In [1]:
import numpy as np
import pandas as pd

##### Creation Date:
##### January 30 2022
##### Created By Alperen KOLAMUC

##### DataFrame - Series
* DataFrame'ler `pandas`'ta bolca kullanılan bir veri tipi
* DataFrame'i anlamak için önce python `dictionary`'lerinden başlayalım

In [2]:
people = {"name":["Finley", "Andrew", "Blake"], "last_Name":["Brown", "Bradley", "Huges"], "age":[23,21,34]}

In [3]:
people

{'name': ['Finley', 'Andrew', 'Blake'],
 'last_Name': ['Brown', 'Bradley', 'Huges'],
 'age': [23, 21, 34]}

In [4]:
people["name"]

['Finley', 'Andrew', 'Blake']

In [5]:
type(people)

dict

##### Dictionary'lerden DataFrame Oluşturma

In [6]:
a = np.array([1,2,3])

In [7]:
a

array([1, 2, 3])

In [8]:
df = pd.DataFrame(people)

In [9]:
df

     name last_Name  age
0  Finley     Brown   23
1  Andrew   Bradley   21
2   Blake     Huges   34

In [10]:
df["name"]

0    Finley
1    Andrew
2     Blake
Name: name, dtype: object

* `Dictionary'`lerin keyleri  `column` isimleri, value'ları da `column`'un değerleri olmuş oldu

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df.shape

(3, 3)

##### DataFrame'in Column(sütun)'larına Erişmek
* Key değerleri ile `dictionary`lerin value'larına ulaşabiliyorduk

In [13]:
people

{'name': ['Finley', 'Andrew', 'Blake'],
 'last_Name': ['Brown', 'Bradley', 'Huges'],
 'age': [23, 21, 34]}

In [15]:
people["last_Name"]

['Brown', 'Bradley', 'Huges']

In [16]:
df

     name last_Name  age
0  Finley     Brown   23
1  Andrew   Bradley   21
2   Blake     Huges   34

In [18]:
df["name"]

0    Finley
1    Andrew
2     Blake
Name: name, dtype: object

In [20]:
type(df["name"])

pandas.core.series.Series

* `Series` veri tipinde döndü. Bu da `pandas`'ın bir veri tipi. `List`ler ve ya `numpy`'daki arraylar gibi düşünebilirsiniz. Farklı farklı değerleri bir arada tutan konteynır gibi
* **Birden çok Series bir araya gelip DataFrame** oluşturdu. DataFrame'leri Series objelerini bir arada tutan bir konteynır gibi düşünebiliriz. Genellikle birden çok Series objesi döndürüleceği zaman zaten output tipi DataFrame oluyor olacak
* DataFrame'in içerisindeki row (satır)'lar da column (sütun)'lar da Series olacak düşünülebilir
* Column'un değerlerine şu şekilde de ulaşabiliyoruz

In [21]:
df.last_Name

0      Brown
1    Bradley
2      Huges
Name: last_Name, dtype: object

##### Read Csv

In [29]:
df = pd.read_csv("data.csv")

In [30]:
df

        name lastName  age
0    Alperen  Kolamuc   18
1  Cristiano  Ronaldo   35
2      Sinan    Engin   48
3      Fırat  Aydınus   42

##### DataFrame - Birden Çok Clomun'a Ulaşmak

In [31]:
df["name"]

0      Alperen
1    Cristiano
2        Sinan
3        Fırat
Name: name, dtype: object

In [32]:
df[["name", "age"]]

        name  age
0    Alperen   18
1  Cristiano   35
2      Sinan   48
3      Fırat   42